# Тест 1
# 1 балл
# 1. (a + b * c)2       2. a - 4 * b / c          3. (a * b + 4) / (c - 1)

# *********************************************************************************************************************
# 1. (a + b * c)2
a = 2
b = 5
c = 8

k = (a + b * c) * 2
print("Значение уровнения (a + b * c)2 =  ", k)

#**********************************************************************************************************************

# 2. a - 4 * b / c


a = 2
b = 5
c = 8

k = a - 4 * b / c

print("Значение уровнения a - 4 * b / c =  ", k)

#**********************************************************************************************************************

# (a * b + 4) / (c - 1)

a = 2
b = 5
c = 8

k = (a * b + 4) / (c - 1)

print("Значение уровнения (a * b + 4) / (c - 1) =  ", k)


# 2 балла
# 4. Найти произведение нечетных цифр пятизначного целого числа, введенного пользователем с клавиатуры

a = int(input(print("Enter a five-digit integer ")))

a
print(h)